TestEDT/src/DataProcessors/ИнтеграцияБРО_ЭДО/ИнтеграцияБРО_ЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИнтеграцияБРО_ЭДО</name>
</mdclass:DataProcessor>

TestEDT/src/Enums/ТипыДокументовЭДО/ТипыДокументовЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДокументовЭДО</name>
  <enumValues>
    <name>АктВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>АктНаПередачуПрав</name>
  </enumValues>
  <enumValues>
    <name>АктОРасхождениях</name>
  </enumValues>
  <enumValues>
    <name>Внутренний</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ЗаказТовара</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКоммерческихПредложений</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>КаталогТоваров</name>
  </enumValues>
  <enumValues>
    <name>КоммерческоеПредложение</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйСчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПродажахКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОСписанииКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеОператораЭДО</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛист</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>Прикладной</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимости</name>
  </enumValues>
  <enumValues>
    <name>СчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ТоварнаяНакладная</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУточнении</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАктЗаказчик</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАктИсполнитель</name>
  </enumValues>
  <enumValues>
    <name>УдалитьВыпискаБанка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДопДанные</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросЗонд</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНаОтзывЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНочнойВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКвитанция</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОшибка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеТребование</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПроизвольный</name>
  </enumValues>
  <enumValues>
    <name>УдалитьСоглашениеОбИзмененииСтоимостиПолучатель</name>
  </enumValues>
  <enumValues>
    <name>УдалитьТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>УдалитьТОРГ12Покупатель</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УКД</name>
  </enumValues>
  <enumValues>
    <name>УПД</name>
  </enumValues>
  <enumValues>
    <name>АктВзаимозачета</name>
  </enumValues>
  <enumValues>
    <name>АктСверки</name>
  </enumValues>
  <enumValues>
    <name>Ведомость</name>
  </enumValues>
  <enumValues>
    <name>ГарантийноеПисьмо</name>
  </enumValues>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСоглашение</name>
  </enumValues>
  <enumValues>
    <name>КС11</name>
  </enumValues>
  <enumValues>
    <name>КС2</name>
  </enumValues>
  <enumValues>
    <name>КС3</name>
  </enumValues>
  <enumValues>
    <name>Отчет</name>
  </enumValues>
  <enumValues>
    <name>ПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>ПриложениеКАкту</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбЭДО</name>
  </enumValues>
  <enumValues>
    <name>Спецификация</name>
  </enumValues>
  <enumValues>
    <name>Уведомление</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>РеквизитыОрганизации</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Enums/ТипыРегламентовЭДО/ТипыРегламентовЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРегламентовЭДО</name>
  <enumValues>
    <name>УПД</name>
  </enumValues>
  <enumValues>
    <name>Формализованный</name>
  </enumValues>
  <enumValues>
    <name>Неформализованный</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Enums/ТипыЭлементовРегламентаЭДО/ТипыЭлементовРегламентаЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлементовРегламентаЭДО</name>
  <enumValues>
    <name>ИнформацияОтправителя</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияПолучателя</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияПолучателя_ПДО</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияПолучателя_ПДО_ИОП</name>
  </enumValues>
  <enumValues>
    <name>ИОП</name>
  </enumValues>
  <enumValues>
    <name>ИОП_ПДО</name>
  </enumValues>
  <enumValues>
    <name>ИОП_ПДО_ИОП</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ПДО</name>
  </enumValues>
  <enumValues>
    <name>ПДО_ИОП</name>
  </enumValues>
  <enumValues>
    <name>ПДП</name>
  </enumValues>
  <enumValues>
    <name>ПДП_ИОП</name>
  </enumValues>
  <enumValues>
    <name>ПОА</name>
  </enumValues>
  <enumValues>
    <name>ПОА_УОУ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАктЗаказчик</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДИСУКД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДОП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДополнительныйЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДОПУПД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИнформацияПокупателяУКД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИнформацияПокупателяУПД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИПЭСФ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКСЧФДИСУКД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКСЧФУКД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПДОЭСФ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПДПЭСФ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПервичныйЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьСоглашениеОбИзмененииСтоимостиПолучатель</name>
  </enumValues>
  <enumValues>
    <name>УдалитьСЧФДОПУПД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьСЧФУПД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьТОРГ12Покупатель</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУУЭСФ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЭСФ</name>
  </enumValues>
  <enumValues>
    <name>УОУ</name>
  </enumValues>
  <enumValues>
    <name>УОУ_ИОП</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/DataProcessors/ИнтеграцияБРО_ЭДО/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция КодВидаДокументаБРОПоСвойствамЭДО(ТипРегламента, ТипДокумента, ТипЭлементаРегламента) Экспорт
	
	КодВидДокумента = Неопределено;
	Если ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетФактура
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.УПД Тогда
		Если ТипРегламента = Перечисления.ТипыРегламентовЭДО.Формализованный Тогда
			КодВидДокумента = "01";
		Иначе
			КодВидДокумента = "07";
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот Тогда
		Если ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя Тогда
			КодВидДокумента = "02";
		Иначе
			КодВидДокумента = "06";
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная Тогда
		Если ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя Тогда
			КодВидДокумента = "03";
		Иначе
			КодВидДокумента = "05";
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.УКД Тогда
		Если ТипРегламента = Перечисления.ТипыРегламентовЭДО.Формализованный Тогда
			КодВидДокумента = "04";
		Иначе
			КодВидДокумента = "08";
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости Тогда
		
		КодВидДокумента = "08";
		
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.АктНаПередачуПрав Тогда
		
		КодВидДокумента = "07";
		
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.АктОРасхождениях Тогда
		
		КодВидДокумента = "09";
		
	КонецЕсли;
	
	Возврат КодВидДокумента;
	
КонецФункции

#КонецОбласти
